In [1]:
from pandas import DataFrame, read_csv, read_excel

In [2]:
grade_data=[
    [1,'남자',98,77,88,64],
    [2,'여자',88,90,62,72],
    [1,'남자',92,70,83,79],
    [3,'여자',63,60,31,70],
    [4,'남자',75,50,90,88]
]

df=DataFrame(grade_data)
df

   0   1   2   3   4   5
0  1  남자  98  77  88  64
1  2  여자  88  90  62  72
2  1  남자  92  70  83  79
3  3  여자  63  60  31  70
4  4  남자  75  50  90  88

In [3]:
i_names=['철수','영희','민철','수현','호영']
c_names=['학년','성별','국어','영어','수학','과학']

df=DataFrame(grade_data,index=i_names,columns=c_names)
df

    학년  성별  국어  영어  수학  과학
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [4]:
grade_dic={
    '학년':[1,2,1,3,4],
    '성별':['남자','여자','남자','여자','남자'],
    '국어':[98,88,92,63,75],
    '영어':[77,90,70,60,50],
    '수학':[88,62,83,31,90],
    '과학':[64,72,79,70,88]
}

df=DataFrame(grade_dic)
df

   학년  성별  국어  영어  수학  과학
0   1  남자  98  77  88  64
1   2  여자  88  90  62  72
2   1  남자  92  70  83  79
3   3  여자  63  60  31  70
4   4  남자  75  50  90  88

In [5]:
df=DataFrame(grade_dic,index=['철수','영희','민철','수현','호영'])

df.index.name='이름'
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [6]:
grade_list=[
    {'이름':'철수','학년':1,'성별':'남자','국어':98,'영어':77,'수학':88,'과학':64},
    {'이름':'영희','학년':2,'성별':'여자','국어':88,'영어':90,'수학':62,'과학':72},
    {'이름':'민철','학년':1,'성별':'남자','국어':92,'영어':70,'수학':83,'과학':79},
    {'이름':'수현','학년':3,'성별':'여자','국어':63,'영어':60,'수학':31,'과학':70},
    {'이름':'호영','학년':4,'성별':'남자','국어':75,'영어':50,'수학':90,'과학':88}
]

df=DataFrame(grade_list)
df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

In [7]:
df2=df.set_index('이름')
df2

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [8]:
df.set_index('이름',inplace=True)
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [9]:
df3=df.reset_index()
df3

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

In [10]:
df3.reset_index()

   index  이름  학년  성별  국어  영어  수학  과학
0      0  철수   1  남자  98  77  88  64
1      1  영희   2  여자  88  90  62  72
2      2  민철   1  남자  92  70  83  79
3      3  수현   3  여자  63  60  31  70
4      4  호영   4  남자  75  50  90  88

In [11]:
df3.reset_index(drop=True)

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

In [12]:
df=read_csv('https://data.hossam.kr/data/grade.csv',encoding='euc-kr')
df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

In [13]:
df=read_csv('https://data.hossam.kr/data/grade.csv',encoding='euc-kr',index_col='이름')
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [15]:
df=read_excel('https://data.hossam.kr/data/grade.xlsx',index_col='이름')
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80